Revit 2024 API
ModifierType Enumeration
 An enumerated type listing options to appear in the exported layer name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Since: 2014
Syntax
C#
public enum ModifierType
Visual Basic
Public Enumeration ModifierType
Visual C++
public enum class ModifierType
Members
Member name | Description
UnknownType |  An unknown (default) type of modifier, not acceptable for assignment.
Category |  Signals that the name of the category will appear in the layer name.
Custom1 |  Signals that the first custom string will appear in the layer name.
Custom2 |  Signals that the second custom string will appear in the layer name.
Custom3 |  Signals that the third custom string will appear in the layer name.
FireRating |  Signals that the value of fire rating will appear in the layer name.
Function |  Signals that the value of function will appear in the layer name.
Level |  Signals that the name of the level will appear in the layer name.
PhaseCreated |  Signals that the name of the created phase will appear in the layer name.
PhaseDemolished |  Signals that the name of the demolition phase will appear in the layer name.
PhaseStatus |  Signals that the value of of phase status will appear in the layer name.
StructuralMaterialType |  Signals that the value of structural material type will appear in the layer name.
StructuralUsage |  Signals that the value of structural usage will appear in the layer name.
SystemName |  Signals that the system name will appear in the layer name.
SystemType |  Signals that the system type will appear in the layer name.
Underlay |  Signals that the name of the underlay will appear in the layer name.
ViewType |  Signals that the view type will appear in the layer name.
Workset |  Signals that the name of the workset will appear in the layer name.
AnalyzesAs |  Signals that the value of the AnalyzesAs parameter will appear in the layer name.
SystemClassification |  Signals that the system classification will appear in the layer name.
DomainType |  Signals that the domain type will appear in the layer name.
FabricationService |  Signals that the fabrication service will appear in the layer name.
See Also
Autodesk.Revit.DB Namespace